{"title":"Learning from Bootstrap 3","language":"en-us","date":"2016-09-01T00:00:00.000Z","categories":"Code","__content":"<h2 id=\"resetscript\">Reset script</h2>\n<p>Different browsers have different default style. To make the user experience consistent among browsers, we have CSS reset script or normalize script. In Bootstrap 3, <code>normalize.less</code> reset the CSS.</p>\n<h2 id=\"htmlaccessibility\">HTML accessibility</h2>\n<p>Web page today have rich UI element. But for blind people, they use screen reader to read the page. They cannot understand image and icon. Bootstrap 3 provide <code>.sr-only</code> and <code>.sr-only-focusable</code> to show content to screen reader without affecting the visual content. <code>.sr-only-focusable</code> appears after the element focused by pressing the 'tab' key. Beside the Bootstrap 3 mixin, there are html attribute like <code>aria-label</code> for accessibility.</p>\n<h2 id=\"lessfunction\">LESS function</h2>\n<p>In LESS, class and mixin share the same syntax. To hide the a mixin, we can add an empty parenthesis after the mixin, like <code>.mixin()</code>. This may create some code like <code>.mixin { .mixin() }</code>. It looks redundant, but it is good in design, as the interface and implementation are separated.</p>\n<!-- more -->\n<h2 id=\"touchaction\"><code>touch-action</code></h2>\n<p>There is a CSS property named <code>touch-action</code>, which can specify the behavior. I cannot understand the description on MDN, and I think this <a href=\"https://www.youtube.com/watch?v=NOzQlS6utRk\">video</a> can help.</p>\n<h2 id=\"spacingtheitemsinsideamenu\">Spacing the items inside a menu</h2>\n<p>It is common to have a list of items in web. The html may looks like:</p>\n<pre><code>&lt;div class=\"menu\"&gt;\n  &lt;div class=\"menu-item\"&gt;&lt;/div&gt;\n  &lt;div class=\"menu-item\"&gt;&lt;/div&gt;\n  &lt;div class=\"menu-item\"&gt;&lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n<p>We usually want space between menu and items, also space among items. I implemented the LESS like</p>\n<pre><code>.menu-item {\n  margin-bottom: 20px;\n  &amp;:first {\n    margin-top: 20px;\n  }\n}\n</code></pre>\n<p>Bootstrap 3 introduce another implementation to me:</p>\n<pre><code>.menu {\n  padding-top: 20px;\n  padding-bottom: 20px;\n  .menu-item + .menu-item {\n    margin-top: 20px;\n  }\n}\n</code></pre>\n<p>I think this implementation is clearer, the padding of menu give space to the start and the end of menu. The <code>.menu-item + .menu-item</code> part gives space between the menu items.</p>\n<h2 id=\"componentanimation\">Component animation</h2>\n<p>The class is well designed. For the fade in animation, <code>.fade</code> need to be added. The animation start when <code>.in</code> is added. The written code is very elegant, but the implementation may not be very trivial. We can refer to this file.</p>\n<p>Bootstrap 3 only have fade in this pure CSS animation. Other component animation is implemented by both CSS and javascript. Need to read the javascript code to understand how to create animation.</p>\n<h2 id=\"techniquetoremovedoubleborder\">Technique to remove double border</h2>\n<p>It is common to have button with border. But when there is a list of buttons, the two borders stick together and become a think border. It looks weird. We can remove the border for adjacent button, like <code>.btn + .btn { border-left: 0 }</code>. But Bootstrap 3 have another implementation, we can shift the border by 1 pixel to make the border overlap. This method works when the border color is not transparent. If the border color have alpha value, the border between buttons will have a deeper color.</p>\n<h2 id=\"componentcontentandcomponentpart\">Component content and component part</h2>\n<p>The dismissible alerts is a good example on implementation CSS component.</p>\n<p>The html of dismissible like:</p>\n<pre><code>&lt;div class=\"alert alert-warning alert-dismissible\"&gt;\n  &lt;button class=\"close\" data-dismiss=\"alert\"&gt;\n    &lt;span aria-hidden=\"true\"&gt;&amp;times;&lt;/span&gt;\n  &lt;/button&gt;\n  Warning! Better check yourself, you're not looking too good.\n&lt;/div&gt;\n</code></pre>\n<p>It makes sense that considering all elements inside are children elements. But in <code>.alert</code>, the <code>.close</code> button is not the content of <code>.alert</code>, but part of it. Bootstrap 3 move the <code>.close</code> button from the 'content' to the '<code>.alert</code> div'. <code>.alert-dismissible</code> add <code>padding-right</code> into the <code>.alert</code> div. The <code>.close</code> button is moved to the <code>padding-right</code> by <code>right: -21px</code>, so the close button do not affect the content.</p>\n<p>I am wondering why not using <code>margin-right: -21px</code>. One of the reason using <code>right</code> is keeping the 'size' of DOM.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/code/bootstrap-3-learning.md","slug":"bootstrap-3-learning"}