{"title":"What is chroot jail?","date":"2016-04-23T13:47:59.000Z","categories":"Diary","__content":"<h2 id=\"wheredoiheardaboutchrootjail\">Where do I heard about chroot jail?</h2>\n<p>I make a <a href=\"https://github.com/199911/git-on-slack\">slack command</a> to run git command on my EC2 server. So I can deploy by typing <code>git pull</code> in my own slack channel. When I share this on my facebook wall, Bill tell me there may be security problem. <code>git diff</code> can be used to read the content ouside the git repo, such as <code>git diff ./empty.txt /etc/passwd</code>. He suggest me to use chroot jail to protect my server.</p>\n<h2 id=\"whatischrootjail\">What is chroot jail?</h2>\n<p><code>chroot</code> is an system command to change the apparent directory of an environment. Application inside the environment have no access to the files and directories outside. The environment just like a jail, so it is called chroot jail.</p>\n<h2 id=\"doiusechrootjail\">Do I use chroot jail?</h2>\n<p>No, because I have dockerized my slack command server. The docker container only have access to my git repos, but not system files. In worst case, hackers can only break my web server, but not my EC2.</p>\n<p>Also, there are <a href=\"https://web.archive.org/web/20160127150916/http://www.bpfh.net/simes/computing/chroot-break.html\">some ways</a> to break the jail. Using chroot has much more things to handle, so I sticky with docker.</p>\n<h2 id=\"dodockerusingchrootjail\">Do docker using chroot jail?</h2>\n<p>Docker is using namespace instead of chroot jail.</p>\n<h2 id=\"howdoesnamespacedifferentfromchrootjail\">How does namespace different from chroot jail?</h2>\n<p>According to <a href=\"https://www.quora.com/How-are-Linux-namespaces-different-from-the-chroot-environment\">this article</a>, namespace can isolate the whole system, while chroot can only isolate the file system. Namespace is a more complete and secure.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/diary/chroot.md","slug":"chroot"}