{"title":"How to fallback CSS file to different CDN","permalink":"/how-to-fallback-to-different-cdn","post":{"title":"How to fallback CSS file to different CDN","date":"2016-12-05T00:00:00.000Z","categories":"Diary","__content":"<p>A user in UK report our site is broken. From the captured screen, it is easy to it is because CSS file fail to load. After testing using <a href=\"https://www.webpagetest.org/\">Webpage Test</a>, I found out the machine in London fail to get the CSS file from MAXCDN. After long comunication with the customer support of CDN and lots of black box remote testing, they confirmed it is some local network error. MaxCDN and I can do nothing but wait until ISP fix the network.</p>\n<p>I come up an idea, can we fallback to other CDN automatically if the current one is fail?</p>\n<!-- More -->\n<h2 id=\"javascriptfiledetection\">Javascript file detection</h2>\n<p>Actually, it is very common in Javascript files. Many dependency management tools ,like require.js and yepnope.js, have built in CDN fallback feature for javascript. <a href=\"http://stackoverflow.com/questions/1014203/best-way-to-use-googles-hosted-jquery-but-fall-back-to-my-hosted-library-on-go\">The implementation is very simple</a>. For example, <code>!!window.jQuery</code> can be used to check jQuery is loaded or not.</p>\n<h2 id=\"cssfiledetectioninfallbackjs\">CSS file detection in fallback.js</h2>\n<p>CSS have nothing do with javascript, how can we detect the style is loaded or not? From the source code of <a href=\"https://github.com/dolox/fallback/blob/v1/fallback.js#L212\">fallback.js</a>, we can use the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Document/styleSheets\">style sheets web apis</a>. We can get every single rules in the styleSheets by javascript. In fallback.js, <code>selectorText</code> is used to detect the style sheet. Notices that it use exact string matching, for example, if you only have a rules <code>.css.is.loaded { display: none; }</code> and the checking of <code>.loaded</code> will be fail, because the value of <code>selectorText</code> is <code>.css.is.loaded</code></p>\n<h2 id=\"stylesheetsapifallback\">Style Sheets API fallback</h2>\n<p><a href=\"http://caniuse.com/#search=stylesheets\">IE 11 and Edge 14 still not support style sheets api</a>, the fallback.js implementation does not works. In this <a href=\"http://eddmann.com/posts/providing-local-js-and-css-resources-for-cdn-fallbacks/\">article</a>, it suggests to have a string match which the background color style: <code>$('body').css('color') !== 'rgb(51, 51, 51)')</code>. It looks not very reliable, as the css need to have exactly the same format as <code>rgb(DD, DD, DD)</code>, I have check a few browser and the string format is exactly the same.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/diary/how-to-fallback-to-different-CDN.md","slug":"how-to-fallback-to-different-cdn"}}