{"title":"HTML and CSS part 2","permalink":"/posts/html-and-css-2","post":{"title":"HTML and CSS part 2","language":"zh-tw","date":"2016-10-01T00:00:00.000Z","categories":"Review","__content":"<h2 id=\"doctype\">Doctype</h2>\n<p>It defines which version of HTML is using, it may affect how the page is rendered.</p>\n<h2 id=\"browsersbug\">Browser's bug</h2>\n<p>Bug is unavoidable in software, no exception in browsers. The bugs in browser is also called browser quirk. Such as the video bug on ipad, the mp4 video url may be put before other's video url.</p>\n<h2 id=\"css3colorsupport\">CSS3 color support</h2>\n<p>CSS3 support opacity, so we can have RGBa. A new color code HSL is supported, also HSLa.</p>\n<h2 id=\"tipsaboutreservedbackground\">Tips about reserved background</h2>\n<p>If text has a light color on a dark background), you can increase the height between lines and the weight of the font to make it easier to read.</p>\n<!-- more -->\n<h2 id=\"brightnessvslightness\">Brightness vs lightness</h2>\n<p>Brightness only adds black, whereas lightness offers both white and black.</p>\n<h2 id=\"serifsansserifmonospacecursiveandfantasy\">serif, sans serif, monospace, cursive and fantasy</h2>\n<p>Use serif for long text,it is easier to read. Sans serif is clearer to read, better for small text. Use monospace for code, easier to align.\nCursive fonts look like handwriting. Also Fantasy font is for decoration.</p>\n<h2 id=\"italicvsoblique\">italic vs oblique</h2>\n<p>Italic have cursive aspect (a new font), oblique just put font at a angle.</p>\n<h2 id=\"texttransform\">Text transform</h2>\n<p>There are CSS to transform text to uppercase, lowercase, or make the first character capitalize</p>\n<h2 id=\"lineheight\">line height</h2>\n<p>When line height is larger than the font size, there is a gap above the text. The gap is named 'leading'. In other words, line height - font size = leading.</p>\n<h2 id=\"letterspacingandwordspacing\">letter spacing and word spacing</h2>\n<p>There are CSS to control the spacing between letters and words. These are style seems does not work well in Chinese or other language using block characters.</p>\n<h2 id=\"verticalalign\">vertical align</h2>\n<p><code>vertical</code> align should be the most commonly misunderstood style. It is not intended to allow you to vertically align text in the middle of block level elements (but this works in table cells, such as <code>td</code> and <code>th</code>). It replaces the depreciated <code>align</code> HTML attribute. It is used in inline elements.</p>\n<h2 id=\"textindent\">text-indent</h2>\n<p>It is used in a trick to hide the text which is only available for screen reader and SEO. But in Bootstrap 3, there is a better trick with better performance.</p>\n<h2 id=\"pseudoelements\">Pseudo-elements</h2>\n<ul>\n<li><code>:first-letter</code> and <code>:first-line</code>: select first letter or line in text.</li>\n<li><code>:link</code> and <code>:visited</code>: select not visited and visited <code>&lt;a&gt;</code> link.</li>\n<li><code>:active</code>: select element is being activated by a user.</li>\n<li>pressed button</li>\n<li>clicked link.</li>\n<li><code>:focus</code>: elements that can be interacted with have focus state.</li>\n<li>from input with cursor in it</li>\n<li>It is also possible to use tab key to focus</li>\n<li>When pseduo classes are used, they should appear in this order:</li>\n</ul>\n<ol>\n<li><code>:link</code></li>\n<li><code>:visited</code></li>\n<li><code>:hover</code></li>\n<li><code>:focus</code></li>\n<li><code>:active</code></li>\n</ol>\n<h2 id=\"shadowincss3\">Shadow in CSS3</h2>\n<p><code>box-shadow</code> and <code>text-shadow</code> are new style in CSS3.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/review/html-and-css-2.md","slug":"html-and-css-2"}}