{"title":"Learning a programming language","permalink":"/posts/learning-a-programming-language","post":{"title":"Learning a programming language","language":"zh-tw","date":"2016-06-10T00:00:00.000Z","categories":"Diary","__content":"<p>I realize I learn a programming language in an inefficient way. I can learn how to write code quickly, but it is difficult to write elegant code.</p>\n<!-- more -->\n<h2 id=\"howprogrammingisdifferentfromothersciencesubject\">How programming is different from other science subject</h2>\n<p>You cannot ask why there are natural number. You cannot ask why there are gravity. It is the law of the world, decide by God. But for programming language, which is design by people for some reason. It is alway good to ask why the programming language is design in this way.</p>\n<h2 id=\"whatcanbelearnfromprogramminglanguage\">What can be learn from programming language</h2>\n<p>First of all, code in any programming languages will be convert to machine code. They have the same power on solving problems, why we need different programming language?</p>\n<p>Programming language is also an abstraction, using language problem, syntatic sugar to simplify the programming task, make developers' life easier. Learning programming language is asking why the language designer going to abstract programming in this way. The designers of programming language integrate good design pattern and useful techniques into the language. For example, many good design pattern is integrated of C language is become language feature of other languages. Such as the template method become the concept of class and object in OOP. The function pointer becomes first class function in functional language.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>When learning a language, we should think about why it is designed in this way. After understanding the principle, we can write better code, or apply the good pattern in another language.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/diary/learning-a-programming-language.md","slug":"learning-a-programming-language"}}