{"title":"Review of \"The Key To Accelerating Your Coding Skills\"","permalink":"/learn-to-code-and-be-self-reliant","post":{"title":"Review of \"The Key To Accelerating Your Coding Skills\"","date":"2016-05-15T00:00:00.000Z","categories":"Review","__content":"<p>You will never know everything you need to solve all your problems. The key point is learn how to figure stuff out on our own.</p>\n<h2 id=\"beginner\">Beginner</h2>\n<p>At first we learn domain specific knowledge. For example prgoramming language syntax, library function. Some facts that cannot be generalize.</p>\n<!-- more -->\n<h2 id=\"nextstep\">Next Step</h2>\n<p>Learn how to read debug message and fix the code on your own. We also need to understand each error message resolved, to generalize our experience on fixing bugs.</p>\n<h2 id=\"aselfsufficientprogrammer\">A self-sufficient programmer</h2>\n<p>Able to googling and finding solution. Can reference to the code we have written and follow the pattern. It is a process to generalize the experience and knowledge.</p>\n<p>These knowledge help us to teach ourself what we don’t know along the way. With these skill we can do specific task, even we have not know everything about our task.</p>\n<h2 id=\"howtolearntobeselfsufficientefficiently\">How to learn to be self-sufficient efficiently</h2>\n<ol>\n<li>Ask ourself \"Do I build similar thing before?\"</li>\n<li>Learn to read documentation and code instead of video tutorial.</li>\n<li>Learn how to build thing from scratch and deploy.</li>\n</ol>\n<h2 id=\"tips\">Tips</h2>\n<ol>\n<li>Be patient and understand this is a difficult process and go easy on yourself. </li>\n<li>Work consistently, but don’t overwork yourself.</li>\n</ol>\n<p>Reference: <a href=\"http://blog.thefirehoseproject.com/posts/learn-to-code-and-be-self-reliant/\">The Key To Accelerating Your Coding Skills</a></p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/review/learn-to-code-and-be-self-reliant.md","slug":"learn-to-code-and-be-self-reliant"}}