{"title":"Review of \"Making Abstract Products Makes Things Hard\"","permalink":"/making-abstract-products-is-hard","post":{"title":"Review of \"Making Abstract Products Makes Things Hard\"","date":"2016-05-14T00:00:00.000Z","categories":"Review","__content":"<h2 id=\"learning\">Learning</h2>\n<h3 id=\"businesscanbedividedtoprovidingproductorservice\">Business can be divided to providing product or service</h3>\n<p>Product is something can be transfered to customer, but service cannot. A business can provide both. Software is a service.</p>\n<!-- more -->\n<h1 id=\"softwareisanabstractproduct\">Software is an abstract product</h1>\n<p>We cannot 'see' a software, so it is abstract. </p>\n<p>We are shipping code to user and user can 'get' a UI. Why we cannot see a software? UI is just a tip of the iceberg of software, the functional unit is the code behind. Code is the reflection of coder's mental working, show how the programmer organize the logic, how to divide and solve the problems. As the software can be change quickly, a software is a living product, not a static one. A tech company is also providing service to maintain the software.</p>\n<h3 id=\"softwaresarecomplex\">Softwares are complex</h3>\n<p>Software is instructions to computer. A computer is actually doing simple calculation, changing bits from 0 to 1 or from 1 to 0. To make a software from simple instruction is extremely complex. So programmer pack the small sets instructions together to form some commands and pack the commands in to module. Therefore, we can create a software with higher level commands. We are calling the ways we pack the commands as \"creating layers of software abstractions\".</p>\n<p>Each layer of abstraction simple a large amount of instruction. If anyone get lost in one or two layer, they will have no idea what the software is going on.</p>\n<p>Software is too complex to manage, especially it have not physical constraints and cost to limit the complexity of a software.</p>\n<p>Reference: <a href=\"http://arthurtw.github.io/2015/02/01/making-abstract-products-makes-things-hard.html\">Making Abstract Products Makes Things Hard</a></p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/review/making-abstract-products-is-hard.md","slug":"making-abstract-products-is-hard"}}