{"title":"Is code reusing always good?","permalink":"/posts/reusability","post":{"title":"Is code reusing always good?","date":"2016-05-02T23:01:24.000Z","categories":"Diary","__content":"<p>Everytime we need a new feature, code need to be added. Adding a new feature is not difficult, the most difficult part is how to add the new code. Can the new code bug be easily extended? Can the new code be reuse?</p>\n<p>When come to reusability, things become tricky. I always try to integrate the new feature into current routine, to make the code \"reusable\". But it is not a good idea everytime.</p>\n<!-- more -->\n<p>When the function is shared by many components, the new feature may not be compatable with all components. It takes lots of effort the handle the conflict. </p>\n<p>After spending effort to integrate the new feature, we may find we need to customize some component, we have to break the function into two. The effort on making the code \"reusable\" is wasted.</p>\n<p>It is time consuming to refactor the same piece of code again and again. That's why i come up with a question: When to reuse code?</p>\n<h2 id=\"functionalcodevsgluecode\">Functional code vs glue code</h2>\n<p>I divide the code into two types, functional code and glue code. Functional code is the core logic. It can be business logic, database logic and other logic which is 'working'. Glue code is the code which join different components, libraries and functional code together. It perform wrapping the interface, data formating.</p>\n<h2 id=\"neverreusegluecodeeventhecodeisexactlythesame\">Never reuse glue code, even the code is exactly the same</h2>\n<p>Glue code is doing integration. It join two components together, it can never be decoupled from that components. In other words, glue code is tailor made for and depends on specific components. The glue code cannot be reused from the ground up. Sometime you may found the glue code are similiar, but it is just a coincidence. After a few iteration and development the glue code can be completely different. Don't waste time on making it reusable.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/diary/reusability.md","slug":"reusability"}}