{"title":"Skills for hackathon","permalink":"/posts/skills-for-hackathon","post":{"title":"Skills for hackathon","language":"zh-tw","date":"2016-05-23T00:00:00.000Z","categories":"Diary","__content":"<p>After joining angelhack, I identify some useful skill sets for hackathon.</p>\n<h2 id=\"technology\">Technology</h2>\n<p>The mission of developer in hackathon is to make software for presentation. </p>\n<ul>\n<li>UI and UX is everything, developer should put most effort on it</li>\n<li>Hardcode everything<ul>\n<li>If it can save development time</li>\n<li>If it can make the presentation more smooth<ul>\n<li>If the computation is slow, just hardcode it to make it fast.</li></ul></li></ul></li>\n<li>Forget everything about backend<ul>\n<li>Because it cannot be 'seen' by judges</li></ul></li>\n<li>Learn to use prototype tool and API before hackathon<ul>\n<li>This help us build good looking and 'functional' prototype.</li></ul></li>\n</ul>\n<!-- more -->\n<h2 id=\"design\">Design</h2>\n<p>User Experience and User Interface is the key point. It is the visual content for judges</p>\n<ul>\n<li>Interface need to be clean and simple, it helps judges to focus on the feature you are going to present.</li>\n<li>The operation should be intuitive enough, judges should be able to use it without learning.<ul>\n<li>Save time on explain how to use in pitch<ul>\n<li>It is wasting time to explain \"We click this button to perform bla bla bla...\" to judges</li></ul></li></ul></li>\n</ul>\n<h2 id=\"pitch\">Pitch</h2>\n<p>Presnetation time is too short. Squeese the speech to maximize the value of every word you speak.</p>\n<ul>\n<li>Don't waste time on saying anything cannot add value to the product.<ul>\n<li>such as team introduction</li></ul></li>\n<li>User Story may not be very useful<ul>\n<li>Time is too short for demonstrate your product after provide a user story</li></ul></li>\n<li>Present your idea and demonstrate your prototype at the same time<ul>\n<li>Use one or two sentence to explain your idea<ul>\n<li>Your idea must be simple and well-known.<ul>\n<li>The idea can be solving some simple problems in daily lives</li></ul></li></ul></li>\n<li>One member demonstrate the usage of prototype<ul>\n<li>The UI/UX of prototype must be clear and simple</li></ul></li>\n<li>Another member explain the function and idea of the prototype</li></ul></li>\n<li>If your prototype is using some common technology, technical part can be skipped</li>\n</ul>\n<h2 id=\"productdesign\">Product design</h2>\n<p>In the aspect of engineer, we are always focus on problem. We identify the problem and then find out best solution to solve it. </p>\n<p>But in businuess, it is not the case. Even you solution is perfect, the client may not use them. Some client don't think a problem is problem, they may not want to solve it.</p>\n<p>To design a product, we can focus on what do user need. Sometimes, client is not paying to buy an object, but some abstract values or feelings. For example, some people spend lots of money on online games not because they enjoy the game, they may just want to show off and beat other player. That is the feeling the client want to buy.</p>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/diary/skills-for-hackathon.md","slug":"skills-for-hackathon"}}