{"title":"Review of 'Key points on giving a tech talk'","permalink":"/tech-talk-key-points","post":{"title":"Review of 'Key points on giving a tech talk'","date":"2016-06-16T00:00:00.000Z","categories":"Review","__content":"<p>There are three common problems in a tech talk</p>\n<ul>\n<li>Time management</li>\n<li>Too much tech content</li>\n<li>Lack of practice</li>\n</ul>\n<!-- more -->\n<h2 id=\"timemanagement\">Time management</h2>\n<p>Nervous speakers usually speak too fast. Listeners do not have enough time to understand the material. Another case is the speaker becomed too excited, spent too much time on a small part and overrun. At the end, the speaker have to skip part of the contents.</p>\n<p>To prevent overrun, we can limit the amount of material. Here are some rule of thumbs.</p>\n<ul>\n<li>Spend one minute for one page of slide</li>\n<li>Keep 10 minute for Q&amp;A section</li>\n<li>A 45 minute presentation, prepare 30 to 40 pages of slide</li>\n</ul>\n<p>It is always good to have rehearsal. It can make presenter less nervous and presenter have data to tune the content and the weight on slides.</p>\n<h2 id=\"toomuchtechcontent\">Too much tech content</h2>\n<p>Presentation is not documentation. The focus is not on how much the presenter can speak, but how much listeners can take away. Presentation is communication. We have to catch the listeners' attention. Speaker need to present the content in an interesting way, with solid example and detail explanation. When we have not enough time to present all content, we have to remove some of them, even it is worth sharing. </p>\n<h2 id=\"lackofpractice\">Lack of practice</h2>\n<p>Practice make perfect. Good presenter practise controlling the pace of talk and interacting with listeners. Recording our own presentation can help us to make progress.</p>\n<h2 id=\"reference\">Reference</h2>\n<ul>\n<li><a href=\"http://blog.devtang.com/2016/06/05/tech-talk-notes/\">技术演讲中最容易被忽视的问题</a></li>\n</ul>","filePath":"/Users/sunday/workspace/coding-sunday/source/_posts/review/tech-talk-key-points.md","slug":"tech-talk-key-points"}}